#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-prod-sso-requests/runs/run-3PUj65dvQw2zZeXz

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=7pXWFg]
random_password.db_password: Refreshing state... [id=none]
module.s3_ocp.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-ocp]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
module.s3_sysdig.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-sysdig]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=kgodz1zmk2]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-keycloak]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.app: Refreshing state... [id=sniyra]
aws_api_gateway_resource.actions: Refreshing state... [id=vw6kd8]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cn65f5]
aws_api_gateway_resource.proxy: Refreshing state... [id=aqhevc]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-kgodz1zmk2-cn65f5-ANY]
aws_security_group.rds_sg: Refreshing state... [id=sg-0cbc5116a7eb44966]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-kgodz1zmk2-aqhevc-ANY]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-006d5ccf7acdb99cc]
module.s3_ocp.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-ocp,private]
module.s3_ocp.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_sysdig.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-sysdig,private]
module.s3_sysdig.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_sysdig.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-keycloak]
module.s3_sysdig.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-sysdig]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-keycloak]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210903190658559400000001]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-3019186098]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-kgodz1zmk2-cn65f5-ANY]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-kgodz1zmk2-aqhevc-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=njfdb0]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.db.aws_db_subnet_group.this[0] has been changed
  ~ resource "aws_db_subnet_group" "this" {
        id                      = "aurora-db-postgres"
        name                    = "aurora-db-postgres"
      + supported_network_types = [
          + "IPV4",
        ]
        tags                    = {
            "Name"       = "aurora-aurora-db-postgres"
            "managed-by" = "terraform"
        }
        # (4 unchanged attributes hidden)
    }
  # module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this has been deleted
  - resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      - bucket = "xgr00q-prod-keycloak" -> null
      - id     = "xgr00q-prod-keycloak" -> null

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }
  # module.s3_ocp.aws_s3_bucket_server_side_encryption_configuration.this has been deleted
  - resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      - bucket = "xgr00q-prod-ocp" -> null
      - id     = "xgr00q-prod-ocp" -> null

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }
  # module.s3_sysdig.aws_s3_bucket_server_side_encryption_configuration.this has been deleted
  - resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      - bucket = "xgr00q-prod-sysdig" -> null
      - id     = "xgr00q-prod-sysdig" -> null

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-08-24T16:20:58.558Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "api.loginproxy.gov.bc.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "api.loginproxy.gov.bc.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "api.loginproxy.gov.bc.ca",
        ]
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2022-03-14T23:18:58Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:751704728437:kgodz1zmk2/test" -> (known after apply)
      ~ id            = "njfdb0" -> (known after apply)
      ~ invoke_url    = "https://kgodz1zmk2.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "6e01ec80f03a64fa559e756464625206733e6c5c"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.api will be created
  + resource "aws_api_gateway_integration" "api" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kgodz1zmk2"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.openapi_swagger will be created
  + resource "aws_api_gateway_integration" "openapi_swagger" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = (known after apply)
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.header.Content-Disposition" = "method.request.header.Content-Disposition"
          + "integration.request.header.Content-Type"        = "method.request.header.Content-Type"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = "kgodz1zmk2"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:ca-central-1:s3:path/xgr00q-prod-api-swagger/index.html"
    }

  # aws_api_gateway_integration.openapi_swagger_assets will be created
  + resource "aws_api_gateway_integration" "openapi_swagger_assets" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = (known after apply)
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.header.Content-Disposition" = "method.request.header.Content-Disposition"
          + "integration.request.header.Content-Type"        = "method.request.header.Content-Type"
          + "integration.request.path.asset"                 = "method.request.path.asset"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = "kgodz1zmk2"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:ca-central-1:s3:path/xgr00q-prod-api-swagger/{asset}"
    }

  # aws_api_gateway_integration_response.openapi_swagger will be created
  + resource "aws_api_gateway_integration_response" "openapi_swagger" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = "integration.response.header.Content-Disposition"
          + "method.response.header.Content-Type"        = "integration.response.header.Content-Type"
        }
      + rest_api_id         = "kgodz1zmk2"
      + status_code         = "200"
    }

  # aws_api_gateway_integration_response.openapi_swagger_assets will be created
  + resource "aws_api_gateway_integration_response" "openapi_swagger_assets" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = "integration.response.header.Content-Disposition"
          + "method.response.header.Content-Type"        = "integration.response.header.Content-Type"
        }
      + rest_api_id         = "kgodz1zmk2"
      + status_code         = "200"
    }

  # aws_api_gateway_method.api_proxy will be created
  + resource "aws_api_gateway_method" "api_proxy" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kgodz1zmk2"
    }

  # aws_api_gateway_method.openapi_swagger_proxy will be created
  + resource "aws_api_gateway_method" "openapi_swagger_proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Content-Disposition" = true
          + "method.request.header.Content-Type"        = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "kgodz1zmk2"
    }

  # aws_api_gateway_method.swagger_assets_proxy will be created
  + resource "aws_api_gateway_method" "swagger_assets_proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Content-Disposition" = true
          + "method.request.header.Content-Type"        = true
          + "method.request.path.asset"                 = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "kgodz1zmk2"
    }

  # aws_api_gateway_method_response.openapi_swagger_proxy will be created
  + resource "aws_api_gateway_method_response" "openapi_swagger_proxy" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = true
          + "method.response.header.Content-Type"        = true
        }
      + rest_api_id         = "kgodz1zmk2"
      + status_code         = "200"
    }

  # aws_api_gateway_method_response.swagger_assets_proxy will be created
  + resource "aws_api_gateway_method_response" "swagger_assets_proxy" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = true
          + "method.response.header.Content-Type"        = true
        }
      + rest_api_id         = "kgodz1zmk2"
      + status_code         = "200"
    }

  # aws_api_gateway_resource.api will be created
  + resource "aws_api_gateway_resource" "api" {
      + id          = (known after apply)
      + parent_id   = "pi96gjlahi"
      + path        = (known after apply)
      + path_part   = "api"
      + rest_api_id = "kgodz1zmk2"
    }

  # aws_api_gateway_resource.api_proxy will be created
  + resource "aws_api_gateway_resource" "api_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = "kgodz1zmk2"
    }

  # aws_api_gateway_resource.openapi_swagger will be created
  + resource "aws_api_gateway_resource" "openapi_swagger" {
      + id          = (known after apply)
      + parent_id   = "pi96gjlahi"
      + path        = (known after apply)
      + path_part   = "openapi"
      + rest_api_id = "kgodz1zmk2"
    }

  # aws_api_gateway_resource.openapi_swagger_proxy will be created
  + resource "aws_api_gateway_resource" "openapi_swagger_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "swagger"
      + rest_api_id = "kgodz1zmk2"
    }

  # aws_api_gateway_resource.swagger_assets_proxy will be created
  + resource "aws_api_gateway_resource" "swagger_assets_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{asset}"
      + rest_api_id = "kgodz1zmk2"
    }

  # aws_api_gateway_rest_api.sso_backend will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "sso_backend" {
        id                           = "kgodz1zmk2"
        name                         = "SSOApi"
        tags                         = {}
        # (10 unchanged attributes hidden)

      ~ endpoint_configuration {
          ~ types            = [
              - "EDGE",
              + "REGIONAL",
            ]
            # (1 unchanged attribute hidden)
        }
    }

  # aws_apigatewayv2_api_mapping.this will be created
  + resource "aws_apigatewayv2_api_mapping" "this" {
      + api_id      = "kgodz1zmk2"
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = "test"
    }

  # aws_apigatewayv2_domain_name.this will be created
  + resource "aws_apigatewayv2_domain_name" "this" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "api.loginproxy.gov.bc.ca"
      + id                               = (known after apply)
      + tags_all                         = (known after apply)

      + domain_name_configuration {
          + certificate_arn                        = (known after apply)
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # aws_iam_role.api_gateway_s3_role will be created
  + resource "aws_iam_role" "api_gateway_s3_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ApiGatewayAmazonS3AccessRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.s3_read_access_policy will be created
  + resource "aws_iam_role_policy" "s3_read_access_policy" {
      + id     = (known after apply)
      + name   = "AWSS3ResourceReadAccessRolePolicy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-08-24T16:20:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "/JrNmFM2DEekdMvpEFk6zLjsgLdQY9BE5vZE50H9nUw=" -> "tPbIMw2U5cnC7pPJXZ3aSUUiMOFeA9dora2xWYVq5bk="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-08-24T16:20:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "9RtHPXvpBMaeRTm3+dXkzqV9cVLKrXQsrCWoIDeDuq0=" -> "cffvlnusSky4pWvDFE5UlQ+IR34mxbxXdwyMyMe7L70="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be created
  + resource "aws_lambda_function" "css_api" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda-css-api.zip"
      + function_name                  = "lambda-css-api"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::751704728437:role/iam_for_lambda"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "HxGcHLe81vupMtW05IsyYvgK71N1nR7ogwCGns9KUhw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "managed-by" = "terraform"
        }
      + tags_all                       = {
          + "managed-by" = "terraform"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ALLOW_GOLD"                     = "true"
              + "ALLOW_SILVER"                   = "true"
              + "API_URL"                        = "https://kgodz1zmk2.execute-api.ca-central-1.amazonaws.com/test/app"
              + "APP_ENV"                        = "production"
              + "APP_URL"                        = "https://bcgov.github.io/sso-requests"
              + "BCEID_WEBSERVICE_PROXY"         = "https://realm-registry.apps.silver.devops.gov.bc.ca/api/bceid-service"
              + "CHES_API_ENDPOINT"              = "https://ches.nrs.gov.bc.ca/api/v1/email"
              + "CHES_PASSWORD"                  = (sensitive)
              + "CHES_TOKEN_ENDPOINT"            = "https://oidc.gov.bc.ca/auth/realms/jbd6rnxw/protocol/openid-connect/token"
              + "CHES_USERNAME"                  = (sensitive)
              + "CONFIGURATION_ENDPOINT"         = "https://oidc.gov.bc.ca/auth/realms/onestopauth/.well-known/openid-configuration"
              + "DB_HOSTNAME"                    = "aurora-db-postgres.cluster-cep2rylvmmgj.ca-central-1.rds.amazonaws.com"
              + "DB_NAME"                        = "ssorequests"
              + "DB_PASSWORD"                    = (sensitive)
              + "DB_USERNAME"                    = (sensitive)
              + "GH_ACCESS_TOKEN"                = (sensitive)
              + "GH_BRANCH"                      = "main"
              + "GH_OWNER"                       = "bcgov"
              + "GH_REPO"                        = "sso_terraform"
              + "GH_WORKFLOW_ID"                 = "request.yml"
              + "KEYCLOAK_DEV_CLIENT_ID"         = "terraform-cli"
              + "KEYCLOAK_DEV_CLIENT_SECRET"     = "5ba13228-397c-4c0e-89e8-bd2907f16409"
              + "KEYCLOAK_DEV_URL"               = "https://dev.oidc.gov.bc.ca"
              + "KEYCLOAK_PROD_CLIENT_ID"        = "terraform-cli"
              + "KEYCLOAK_PROD_CLIENT_SECRET"    = "2ce2522c-824b-473e-ae43-2b03b80825e6"
              + "KEYCLOAK_PROD_URL"              = "https://oidc.gov.bc.ca"
              + "KEYCLOAK_TEST_CLIENT_ID"        = "terraform-cli"
              + "KEYCLOAK_TEST_CLIENT_SECRET"    = "ec6827bd-0d1e-4d46-a954-2672345e8741"
              + "KEYCLOAK_TEST_URL"              = "https://test.oidc.gov.bc.ca"
              + "KEYCLOAK_V2_DEV_CLIENT_ID"      = "terraform-cli"
              + "KEYCLOAK_V2_DEV_CLIENT_SECRET"  = "f7198966-1903-40e4-848c-8f5233867a34"
              + "KEYCLOAK_V2_DEV_URL"            = "https://dev.loginproxy.gov.bc.ca"
              + "KEYCLOAK_V2_PROD_CLIENT_ID"     = "terraform-cli"
              + "KEYCLOAK_V2_PROD_CLIENT_SECRET" = "b4837457-ccff-40f3-b907-aa9fc855b686"
              + "KEYCLOAK_V2_PROD_URL"           = "https://loginproxy.gov.bc.ca"
              + "KEYCLOAK_V2_TEST_CLIENT_ID"     = "terraform-cli"
              + "KEYCLOAK_V2_TEST_CLIENT_SECRET" = "5378d988-7cf5-431c-aac0-f0f78ba08745"
              + "KEYCLOAK_V2_TEST_URL"           = "https://test.loginproxy.gov.bc.ca"
              + "LOCAL_DEV"                      = "false"
              + "NODE_ENV"                       = "production"
              + "SSO_CLIENT_ID"                  = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0cbc5116a7eb44966",
            ]
          + subnet_ids         = [
              + "subnet-0b7cfc2250fbc9009",
              + "subnet-0bace7fcb69dcfb23",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-08-24T16:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "l8UzAS9A1BDMdVmy5ejZQUtw02sih7bAaSSvh+IcScQ=" -> "6HduT0H97830lCz9ZsuhBRStBsOjVBvZfNKIKsCgExs="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-08-24T16:20:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "mYrdzK+VZLqG7NpGMWBDPTLQGptU1IHTc9yTogJaizU=" -> "tmIYMbNO2luTD7M4ZnRjKNmuIOHEs/3SRpUaOAVQD2o="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_permission.apigw_api will be created
  + resource "aws_lambda_permission" "apigw_api" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lambda-css-api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ca-central-1:751704728437:kgodz1zmk2/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_object.swagger_dist["README.md"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "b4db97646e947691772eace4c7735928"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "README.md"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/README.md"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["absolute-path.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "7ca5ebff3b35e49ef75f96885c6ed7c2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "absolute-path.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/absolute-path.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["favicon-16x16.png"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = "f0ae831196d55d8f4115b6c5e8ec5384"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon-16x16.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/favicon-16x16.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["favicon-32x32.png"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = "40d4f2c38d1cd854ad463f16373cbcb6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon-32x32.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/favicon-32x32.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["index.css"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "54fdd628e48969ad325a0b370af12f53"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/index.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["index.html"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "c435050a755f3ba71a4df97e599b71c9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["index.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "4843f77ccf9e12e7e60efa279baaffb3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/index.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["oauth2-redirect.html"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "3ab4f43d18d78a61dde617b747479e96"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "oauth2-redirect.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/oauth2-redirect.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["package.json"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "5f267c2709d8898b6d8000170fcf3420"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "package.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/package.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-initializer.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "1e0aac5572865132f120e6675d27dae0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-initializer.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-initializer.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-output.json"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "e121b30bc6394cd9618e97437b9c4573"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-output.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-output.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-bundle.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "e0ae76d9795806abae1f7781d89d4f4b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-bundle.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-bundle.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "b549c47d456f47d5c1cc21fb245266a6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-bundle.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-bundle.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "0bdf99b84564bfe12569762297fa8cf5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-es-bundle-core.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-es-bundle-core.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "4ed1de27405e80c1120ff81e2f3db61b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-es-bundle-core.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-es-bundle-core.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "283ed240f92b4b56d8482b5f1e519274"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-es-bundle.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-es-bundle.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "6405e42f91756697fa77db303cbaddef"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-es-bundle.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-es-bundle.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "8e0e2470d0530680f6f16c7817337891"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-standalone-preset.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-standalone-preset.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "c0fb1a3c06697d061e9caeb5a6fab66c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-standalone-preset.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-standalone-preset.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui.css"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "d6de32fafed0ea75ef760baa8ebe2bda"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui.css.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "51d42b332ad7cdcf5fbb5820308e54db"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "35392619ad8e01c979705c4506f0af86"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui.js.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "08b9c55fb78edc1945a01a79b053d8ee"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # random_password.db_password will be updated in-place
  ~ resource "random_password" "db_password" {
        id          = "none"
        # (12 unchanged attributes hidden)
    }

  # module.s3_sso_api_swagger.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "xgr00q-prod-api-swagger"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3_sso_api_swagger.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = "xgr00q-prod-api-swagger"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this will be created
  + resource "aws_s3_bucket_cors_configuration" "this" {
      + bucket = "xgr00q-prod-api-swagger"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }
    }

  # module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 50 to add, 6 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url     = "https://kgodz1zmk2.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-08-24T16:20:58.558Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 39 estimated
           $86.4/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*